# parameters
nc: 10 # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
# 7,7, 15,13, 15,34, 26,20, 30,71, 41,35, 69,58, 98,118, 166,241

# gkxfw
# anchors:
#   - [23,36, 49,56, 54,127]  # P3/8
#   - [93,66, 101,216, 165,111]  # P4/16
#   - [177,347, 290,193, 365,408]  # P5/32

# tongdao
# anchors:
#   - [14,13, 27,14, 24,33]  # P3/8
#   - [47,21, 31,77, 53,46]  # P4/16
#   - [101,32, 89,86, 158,214]  # P5/32

# person
# anchors:
#   - [13,36, 25,68, 37,140]  # P3/8
#   - [64,103, 69,226, 110,400]  # P4/16
#   - [159,228, 210,478, 413,549]  # P5/32

# Crowd Human
anchors:
  - [6,12, 11,22, 16,36]  # P3/8
  - [26,46, 28,81, 47,103]  # P4/16
  - [59,174, 88,242, 164,292]  # P5/32

# coco
# anchors:
#   - [10,13, 16,30, 33,23]  # P3/8
#   - [30,61, 62,45, 59,119]  # P4/16
#   - [116,90, 156,198, 373,326]  # P5/32

# xiaochicun_01
# anchors:
#   - [1,2, 2,3, 3,4]  # P3/8
#   - [3,5, 4,7, 5,7]  # P4/16
#   - [5,8, 6,11, 9,21]  # P5/32


# yinyetin
# anchors:
#   - [18,32, 25,57, 34,97]  # P3/8
#   - [52,84, 55,153, 75,112]  # P4/16
#   - [96,162, 119,248, 175,296]  # P5/32

# just ys xtc
# anchors:
#   - [14,48, 20,52, 22,36]  # P3/8
#   - [25,48, 25,56, 27,52]  # P4/16
#   - [30,44, 46,70, 76,129]  # P5/32


backbone:
  #  

  [[-1, 1, Conv, [32, 3, 1]],
   [-1, 1, Conv, [64, 3, 2]],  # 0-P1/2  
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 9
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]], 
   [-1, 1, nn.Upsample, [None, 2, 'bilinear',True]],  
   [[-1, 7], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'bilinear',True]],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 15], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 11], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[18, 21, 24], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
